# Generic Zone Area Property

Source: https://www.revitapidocs.com/2026/a8be7365-30ed-73cb-5d25-1f4db220c531.htm

---

| Generic Zone Area Property |
| --- |

The area for the zone, in square feet.
**Namespace:** Autodesk.Revit.DB.Analysis
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double Area { get; }
```

```
Public ReadOnly Property Area As Double
	Get
```

```
public:
property double Area {
	double get ();
}
```

```
member Area : float with get
```

#### Property Value

Double Remarks The area (the gross area) of a space\-based zone is the sum of the areas of all spaces in the zone. See Also

#### Reference

GenericZone Class Autodesk.Revit.DB.Analysis Namespace